cf/InformationRegisters/NotificationSettings.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>NotificationSettings</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Presentation</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>NotificationEvent</Name>
					<Type>
						<v8:Type>cfg:EnumRef.NotificationEvents</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Object</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>EMailAddress</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/CommonModules/Notifications/Ext/Module.bsl
Procedure AddNotification(NotificationText,NotificationEvent) Export
	
	Query = New Query;
	Query.Text = "SELECT
	             |	NotificationSettings.Object,
	             |	NotificationSettings.EMailAddress AS EMailAddress,
	             |	NotificationSettings.Presentation AS Presentation
	             |FROM
	             |	InformationRegister.NotificationSettings AS NotificationSettings
	             |WHERE
	             |	NotificationSettings.NotificationEvent = &NotificationEvent";
	Query.SetParameter("NotificationEvent",NotificationEvent);
	QueryResult = Query.Execute();
	If NOT QueryResult.IsEmpty() Then
		
		Selection = QueryResult.Select();
		While Selection.Next() Do
			EMail = DataProcessors.EMail.Create();
			
		
			EMail.MailText = NotificationText;
			EMail.Subject = NotificationEvent;
			
			NewRecepient = EMail.RecipientTP.Add();
			NewRecepient.EmailAddress = Selection.EMailAddress;
			NewRecepient.Presentation = Selection.Presentation;
			NewRecepient.Object = Selection.Object;
			
			If NOT EmailModule.SendEMail(SessionParameters.CurrentUser, EMail,True) Then
				Alerts.AddAlert(NStr("en = 'There were errors during sending the e-mail.'; pl = 'Powstały błędy przy wysyłaniu maila.'"));
			EndIf;
			
		EndDo;
		
	EndIf;	
	
EndProcedure
